backend/test-results/load-output.txt

SmartShop/backend on  dev [✘?] is 📦 1.0.0 via ⬢ v25.1.0 on 🐳 v28.3.3 runs 🐙 MR
➜ npm run test:load

> backend@1.0.0 test:load
> node tests/load.test.js

═══════════════════════════════════════
  SmartShop Load Testing Suite
═══════════════════════════════════════
  Base URL: http://localhost:4000
  Start Time: 2025-11-14T16:58:16.314Z
═══════════════════════════════════════


🔥 Running: Health Check - 50 Users
   URL: http://localhost:4000/health
   Users: 50, Duration: 10s
Running 10s test @ http://localhost:4000/health
50 connections


┌─────────┬──────┬──────┬───────┬──────┬─────────┬─────────┬───────┐
│ Stat    │ 2.5% │ 50%  │ 97.5% │ 99%  │ Avg     │ Stdev   │ Max   │
├─────────┼──────┼──────┼───────┼──────┼─────────┼─────────┼───────┤
│ Latency │ 2 ms │ 2 ms │ 4 ms  │ 5 ms │ 2.22 ms │ 0.88 ms │ 94 ms │
└─────────┴──────┴──────┴───────┴──────┴─────────┴─────────┴───────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬──────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg      │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼────────┼─────────┤
│ Req/Sec   │ 15,519  │ 15,519  │ 18,271  │ 18,943  │ 18,022.8 │ 932.03 │ 15,519  │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼────────┼─────────┤
│ Bytes/Sec │ 14.9 MB │ 14.9 MB │ 17.6 MB │ 18.2 MB │ 17.3 MB  │ 896 kB │ 14.9 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴──────────┴────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

180k requests in 10.02s, 173 MB read
   ✓ Avg Latency: 2.22ms
   ✓ Min Latency: 2.00ms
   ✓ P95 Latency: 0.00ms
   ✓ Max Latency: 94.00ms
   ✓ Throughput: 18022.80 req/s
   ✓ Total Requests: 180215
   ✓ Failed Requests: 0
   ✓ Error Rate: 0%

🔥 Running: Health Check - 100 Users
   URL: http://localhost:4000/health
   Users: 100, Duration: 10s
Running 10s test @ http://localhost:4000/health
100 connections


┌─────────┬──────┬──────┬───────┬──────┬────────┬─────────┬────────┐
│ Stat    │ 2.5% │ 50%  │ 97.5% │ 99%  │ Avg    │ Stdev   │ Max    │
├─────────┼──────┼──────┼───────┼──────┼────────┼─────────┼────────┤
│ Latency │ 5 ms │ 5 ms │ 6 ms  │ 6 ms │ 5.1 ms │ 3.03 ms │ 289 ms │
└─────────┴──────┴──────┴───────┴──────┴────────┴─────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬───────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg       │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼───────────┼────────┼─────────┤
│ Req/Sec   │ 17,295  │ 17,295  │ 18,591  │ 18,655  │ 18,336.73 │ 482.1  │ 17,292  │
├───────────┼─────────┼─────────┼─────────┼─────────┼───────────┼────────┼─────────┤
│ Bytes/Sec │ 16.6 MB │ 16.6 MB │ 17.9 MB │ 17.9 MB │ 17.6 MB   │ 462 kB │ 16.6 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴───────────┴────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 11

202k requests in 11.01s, 194 MB read
   ✓ Avg Latency: 5.10ms
   ✓ Min Latency: 1.00ms
   ✓ P95 Latency: 0.00ms
   ✓ Max Latency: 289.00ms
   ✓ Throughput: 18336.73 req/s
   ✓ Total Requests: 201705
   ✓ Failed Requests: 0
   ✓ Error Rate: 0%

🔥 Running: Health Check - 500 Users
   URL: http://localhost:4000/health
   Users: 500, Duration: 10s
Running 10s test @ http://localhost:4000/health
500 connections


┌─────────┬──────┬───────┬───────┬───────┬──────────┬───────────┬─────────┐
│ Stat    │ 2.5% │ 50%   │ 97.5% │ 99%   │ Avg      │ Stdev     │ Max     │
├─────────┼──────┼───────┼───────┼───────┼──────────┼───────────┼─────────┤
│ Latency │ 9 ms │ 25 ms │ 30 ms │ 34 ms │ 27.35 ms │ 138.36 ms │ 6412 ms │
└─────────┴──────┴───────┴───────┴───────┴──────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬──────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg      │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼────────┼─────────┤
│ Req/Sec   │ 16,959  │ 16,959  │ 18,127  │ 18,463  │ 17,941.1 │ 463.82 │ 16,956  │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼────────┼─────────┤
│ Bytes/Sec │ 16.3 MB │ 16.3 MB │ 17.4 MB │ 17.7 MB │ 17.2 MB  │ 445 kB │ 16.3 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴──────────┴────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 11

198k requests in 11.03s, 190 MB read
   ✓ Avg Latency: 27.35ms
   ✓ Min Latency: 3.00ms
   ✓ P95 Latency: 0.00ms
   ✓ Max Latency: 6412.00ms
   ✓ Throughput: 17941.10 req/s
   ✓ Total Requests: 197359
   ✓ Failed Requests: 0
   ✓ Error Rate: 0%

🔥 Running: Product List - 50 Users
   URL: http://localhost:4000/api/products
   Users: 50, Duration: 10s
Running 10s test @ http://localhost:4000/api/products
50 connections


┌─────────┬────────┬────────┬────────┬────────┬───────────┬──────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev    │ Max     │
├─────────┼────────┼────────┼────────┼────────┼───────────┼──────────┼─────────┤
│ Latency │ 108 ms │ 179 ms │ 261 ms │ 407 ms │ 184.25 ms │ 70.46 ms │ 1179 ms │
└─────────┴────────┴────────┴────────┴────────┴───────────┴──────────┴─────────┘
┌───────────┬────────┬────────┬────────┬────────┬────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Req/Sec   │ 225    │ 225    │ 269    │ 283    │ 268    │ 16.31   │ 225    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Bytes/Sec │ 761 kB │ 761 kB │ 909 kB │ 957 kB │ 906 kB │ 55.1 kB │ 761 kB │
└───────────┴────────┴────────┴────────┴────────┴────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

3k requests in 10s, 9.06 MB read
   ✓ Avg Latency: 184.25ms
   ✓ Min Latency: 39.00ms
   ✓ P95 Latency: 0.00ms
   ✓ Max Latency: 1179.00ms
   ✓ Throughput: 268.00 req/s
   ✓ Total Requests: 2680
   ✓ Failed Requests: 0
   ✓ Error Rate: 0%

🔥 Running: Product List - 100 Users
   URL: http://localhost:4000/api/products
   Users: 100, Duration: 10s
Running 10s test @ http://localhost:4000/api/products
100 connections


┌─────────┬────────┬────────┬────────┬─────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%     │ Avg       │ Stdev     │ Max     │
├─────────┼────────┼────────┼────────┼─────────┼───────────┼───────────┼─────────┤
│ Latency │ 158 ms │ 325 ms │ 614 ms │ 2036 ms │ 354.59 ms │ 305.38 ms │ 4150 ms │
└─────────┴────────┴────────┴────────┴─────────┴───────────┴───────────┴─────────┘
┌───────────┬────────┬────────┬────────┬────────┬────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Req/Sec   │ 220    │ 220    │ 283    │ 289    │ 276.8  │ 19.18   │ 220    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Bytes/Sec │ 744 kB │ 744 kB │ 957 kB │ 977 kB │ 936 kB │ 64.8 kB │ 744 kB │
└───────────┴────────┴────────┴────────┴────────┴────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

3k requests in 10.01s, 9.36 MB read
   ✓ Avg Latency: 354.59ms
   ✓ Min Latency: 94.00ms
   ✓ P95 Latency: 0.00ms
   ✓ Max Latency: 4150.00ms
   ✓ Throughput: 276.80 req/s
   ✓ Total Requests: 2768
   ✓ Failed Requests: 0
   ✓ Error Rate: 0%

🔥 Running: Product List - 500 Users
   URL: http://localhost:4000/api/products
   Users: 500, Duration: 10s
Running 10s test @ http://localhost:4000/api/products
500 connections

running [==================  ] 90%(node:82843) TimeoutNegativeWarning: -1 is a negative number.
Timeout duration was set to 1.
(Use `node --trace-warnings ...` to show where the warning was created)

┌─────────┬───────┬────────┬─────────┬─────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%   │ 99%     │ Avg       │ Stdev     │ Max     │
├─────────┼───────┼────────┼─────────┼─────────┼───────────┼───────────┼─────────┤
│ Latency │ 95 ms │ 358 ms │ 3012 ms │ 6698 ms │ 513.97 ms │ 982.59 ms │ 9930 ms │
└─────────┴───────┴────────┴─────────┴─────────┴───────────┴───────────┴─────────┘
┌───────────┬────────┬────────┬────────┬────────┬────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Req/Sec   │ 194    │ 194    │ 287    │ 290    │ 276.5  │ 27.74   │ 194    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Bytes/Sec │ 656 kB │ 656 kB │ 970 kB │ 980 kB │ 935 kB │ 93.8 kB │ 656 kB │
└───────────┴────────┴────────┴────────┴────────┴────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

4k requests in 10.03s, 9.35 MB read
354 errors (101 timeouts)
   ✓ Avg Latency: 513.97ms
   ✓ Min Latency: 16.00ms
   ✓ P95 Latency: 0.00ms
   ✓ Max Latency: 9930.00ms
   ✓ Throughput: 276.50 req/s
   ✓ Total Requests: 2765
   ✓ Failed Requests: 354
   ✓ Error Rate: 12.80%

🔥 Running: Product Search - 50 Users
   URL: http://localhost:4000/api/products/search?q=product
   Users: 50, Duration: 10s
Running 10s test @ http://localhost:4000/api/products/search?q=product
50 connections


┌─────────┬───────┬────────┬────────┬─────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%  │ 99%     │ Avg       │ Stdev     │ Max     │
├─────────┼───────┼────────┼────────┼─────────┼───────────┼───────────┼─────────┤
│ Latency │ 85 ms │ 169 ms │ 251 ms │ 1213 ms │ 190.49 ms │ 169.48 ms │ 2076 ms │
└─────────┴───────┴────────┴────────┴─────────┴───────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 19      │ 19      │ 286     │ 289     │ 259.3   │ 80.14   │ 19      │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 2.47 MB │ 2.47 MB │ 37.2 MB │ 37.6 MB │ 33.7 MB │ 10.4 MB │ 2.47 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

3k requests in 10s, 337 MB read
   ✓ Avg Latency: 190.49ms
   ✓ Min Latency: 22.00ms
   ✓ P95 Latency: 0.00ms
   ✓ Max Latency: 2076.00ms
   ✓ Throughput: 259.30 req/s
   ✓ Total Requests: 2593
   ✓ Failed Requests: 0
   ✓ Error Rate: 0%

🔥 Running: Product Search - 100 Users
   URL: http://localhost:4000/api/products/search?q=product
   Users: 100, Duration: 10s
Running 10s test @ http://localhost:4000/api/products/search?q=product
100 connections


┌─────────┬────────┬────────┬────────┬─────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%     │ Avg       │ Stdev     │ Max     │
├─────────┼────────┼────────┼────────┼─────────┼───────────┼───────────┼─────────┤
│ Latency │ 103 ms │ 311 ms │ 484 ms │ 2357 ms │ 340.98 ms │ 353.69 ms │ 4511 ms │
└─────────┴────────┴────────┴────────┴─────────┴───────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬───────┬─────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%   │ 97.5%   │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼───────┼─────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 245     │ 245     │ 292   │ 299     │ 288.11  │ 14.65  │ 245     │
├───────────┼─────────┼─────────┼───────┼─────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 31.9 MB │ 31.9 MB │ 38 MB │ 38.9 MB │ 37.4 MB │ 1.9 MB │ 31.8 MB │
└───────────┴─────────┴─────────┴───────┴─────────┴─────────┴────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

3k requests in 10.01s, 374 MB read
   ✓ Avg Latency: 340.98ms
   ✓ Min Latency: 32.00ms
   ✓ P95 Latency: 0.00ms
   ✓ Max Latency: 4511.00ms
   ✓ Throughput: 288.11 req/s
   ✓ Total Requests: 2881
   ✓ Failed Requests: 0
   ✓ Error Rate: 0%

🔥 Running: Product Search - 500 Users
   URL: http://localhost:4000/api/products/search?q=product
   Users: 500, Duration: 10s
Running 10s test @ http://localhost:4000/api/products/search?q=product
500 connections


┌─────────┬───────┬────────┬─────────┬─────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%   │ 99%     │ Avg       │ Stdev     │ Max     │
├─────────┼───────┼────────┼─────────┼─────────┼───────────┼───────────┼─────────┤
│ Latency │ 98 ms │ 358 ms │ 3031 ms │ 6713 ms │ 511.49 ms │ 989.99 ms │ 9976 ms │
└─────────┴───────┴────────┴─────────┴─────────┴───────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 202     │ 202     │ 291     │ 296     │ 282.11  │ 26.93  │ 202     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 26.3 MB │ 26.3 MB │ 37.8 MB │ 38.5 MB │ 36.7 MB │ 3.5 MB │ 26.3 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

4k requests in 10.03s, 367 MB read
352 errors (100 timeouts)
   ✓ Avg Latency: 511.49ms
   ✓ Min Latency: 39.00ms
   ✓ P95 Latency: 0.00ms
   ✓ Max Latency: 9976.00ms
   ✓ Throughput: 282.11 req/s
   ✓ Total Requests: 2821
   ✓ Failed Requests: 352
   ✓ Error Rate: 12.48%

🔥 Running: Product Detail - 50 Users
   URL: http://localhost:4000/api/products/6912018ccb0db61c33cb1a73
   Users: 50, Duration: 10s
Running 10s test @ http://localhost:4000/api/products/6912018ccb0db61c33cb1a73
50 connections


┌─────────┬──────┬──────┬───────┬───────┬─────────┬─────────┬────────┐
│ Stat    │ 2.5% │ 50%  │ 97.5% │ 99%   │ Avg     │ Stdev   │ Max    │
├─────────┼──────┼──────┼───────┼───────┼─────────┼─────────┼────────┤
│ Latency │ 5 ms │ 8 ms │ 13 ms │ 14 ms │ 8.34 ms │ 2.77 ms │ 144 ms │
└─────────┴──────┴──────┴───────┴───────┴─────────┴─────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 5,235   │ 5,235   │ 5,675   │ 5,855   │ 5,658.8 │ 161.21 │ 5,232   │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 5.96 MB │ 5.96 MB │ 6.46 MB │ 6.66 MB │ 6.44 MB │ 184 kB │ 5.95 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

57k requests in 10s, 64.4 MB read
   ✓ Avg Latency: 8.34ms
   ✓ Min Latency: 2.00ms
   ✓ P95 Latency: 0.00ms
   ✓ Max Latency: 144.00ms
   ✓ Throughput: 5658.80 req/s
   ✓ Total Requests: 56580
   ✓ Failed Requests: 0
   ✓ Error Rate: 0%

🔥 Running: Product Detail - 100 Users
   URL: http://localhost:4000/api/products/6912018ccb0db61c33cb1a73
   Users: 100, Duration: 10s
Running 10s test @ http://localhost:4000/api/products/6912018ccb0db61c33cb1a73
100 connections

running [                    ] 0%(node:82843) MaxListenersExceededWarning: Possible EventEmitter memory leak detected. 11 SIGINT listeners added to [process]. MaxListeners is 10. Use emitter.setMaxListeners() to increase limit

┌─────────┬───────┬───────┬───────┬───────┬──────────┬────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%   │ Avg      │ Stdev  │ Max    │
├─────────┼───────┼───────┼───────┼───────┼──────────┼────────┼────────┤
│ Latency │ 11 ms │ 16 ms │ 25 ms │ 26 ms │ 16.89 ms │ 7.1 ms │ 379 ms │
└─────────┴───────┴───────┴───────┴───────┴──────────┴────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 5,651   │ 5,651   │ 5,735   │ 5,839   │ 5,749.6 │ 65.38   │ 5,650   │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 6.43 MB │ 6.43 MB │ 6.52 MB │ 6.65 MB │ 6.54 MB │ 74.9 kB │ 6.43 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

58k requests in 10.01s, 65.4 MB read
   ✓ Avg Latency: 16.89ms
   ✓ Min Latency: 3.00ms
   ✓ P95 Latency: 0.00ms
   ✓ Max Latency: 379.00ms
   ✓ Throughput: 5749.60 req/s
   ✓ Total Requests: 57494
   ✓ Failed Requests: 0
   ✓ Error Rate: 0%

═══════════════════════════════════════
  Load Testing Complete!
═══════════════════════════════════════


✓ Load test results saved to: /Users/aspandyar/Projects/SmartShop/backend/test-results/load-results-1763139609480.json
✓ CSV results saved to: /Users/aspandyar/Projects/SmartShop/backend/test-results/load-results-1763139609480.csv

📊 LOAD TEST SUMMARY

┌────┬─────────────────────────────────────┬──────┬──────────┬──────────┬────────────┬──────────┬─────────┐
│ #  │ Test Name                           │ Users│ Avg (ms) │ P95 (ms) │ Throughput │ Total Req│ Errors  │
├────┼─────────────────────────────────────┼──────┼──────────┼──────────┼────────────┼──────────┼─────────┤
│  1 │ Health Check - 50 Users             │    50 │     2.22 │     0.00 │   18022.80 │   180215 │       0 │
│  2 │ Health Check - 100 Users            │   100 │     5.10 │     0.00 │   18336.73 │   201705 │       0 │
│  3 │ Health Check - 500 Users            │   500 │    27.35 │     0.00 │   17941.10 │   197359 │       0 │
│  4 │ Product List - 50 Users             │    50 │   184.25 │     0.00 │     268.00 │     2680 │       0 │
│  5 │ Product List - 100 Users            │   100 │   354.59 │     0.00 │     276.80 │     2768 │       0 │
│  6 │ Product List - 500 Users            │   500 │   513.97 │     0.00 │     276.50 │     2765 │     354 │
│  7 │ Product Search - 50 Users           │    50 │   190.49 │     0.00 │     259.30 │     2593 │       0 │
│  8 │ Product Search - 100 Users          │   100 │   340.98 │     0.00 │     288.11 │     2881 │       0 │
│  9 │ Product Search - 500 Users          │   500 │   511.49 │     0.00 │     282.11 │     2821 │     352 │
│ 10 │ Product Detail - 50 Users           │    50 │     8.34 │     0.00 │    5658.80 │    56580 │       0 │
│ 11 │ Product Detail - 100 Users          │   100 │    16.89 │     0.00 │    5749.60 │    57494 │       0 │
└────┴─────────────────────────────────────┴──────┴──────────┴──────────┴────────────┴──────────┴─────────┘


📈 OVERALL STATISTICS

   Average Latency: 195.97ms
   Average Throughput: 6123.62 req/s
   Average Error Rate: 2.30%
   Total Requests Across All Tests: 709861
   Total Failed Requests: 706

✅ All load tests completed successfully